# Conductor Material Id Property

Source: https://www.revitapidocs.com/2026/f4bfc636-845d-0734-6f6b-563d315840d0.htm

---

| Conductor Material Id Property |
| --- |

The Conductor Material id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId Id { get; }
```

```
Public ReadOnly Property Id As ElementId
	Get
```

```
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

```
member Id : ElementId with get
```

#### Property Value

ElementId See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace